// pages/home/home.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      array:["8:00-8:30","8:30-9:00","9:00-9:30","9:30-10:00","10:00-10:30","10:30-11:00","11:00-11:30","12:00-12:30","12:30-13:00","13:00-13:30","13:30-14:00","14:00-14:30","14:30-15:00","15:00-15:30","15:30-16:00","16:00-16:30","16:30-17:00"],
      IDs:["学生","××法院","××事业单位"],
      show:false,
      acknowledge:"—、为提升观众参观体验，严格落实“限量、预约、错峰”措施。开放时间为每日9:00-17:30(16:30 停止入馆,17:00清场)，周一闭馆(法定节假日除外)。二、采取全员实名免费预约参观。未满 14 周岁（含）的未成年人，须由成年人代为预约，并与预约人同步核验入馆。三、观众须使用实名注册手机号码进行预约，每个账号每个参观日可至多预约5人（其中一个订单中14周岁以下未成年人不超过三人）。每个证件号每日只能预约一次。使用虚拟手机号码完成注册的相关账号将被及时清理，同时取消相关预约。四、观众可至多提前7日在“国家博物馆”官网（移动端）和微信公众号、小程序及官方APP预约，每日分为9:00-11: 00、11:00-13:30、13:30-16:30三个预约入馆时段(预约放票时间为每日17:00，退票截止时间为参观当日15:00)。预约成功后，系统自动发送预约成功消息通知，请妥善保存。五、参观当日，请凭本人预约证件原件和预约成功信息，严格按预约时段从北门西侧入馆参观，错过预约时段将谢绝入馆。观众入馆时须配合进行证件核验。军人（含退役军人）、残疾人、60岁以上老人凭本人预约成功信息、优待证件和预约证件原件，可在所预约时段内优先进行证件核验入馆。 六、观众预约账号累积3次未履约(未履约行为包括：入馆时未带预约证件原件进行核验、预约后自行取消订单、参观日未到馆参观等)，该账号将被限制预约30天。七、此《预约须知》自2023年7月13日起施行。中国国家博物馆2023年7月6日",
      date:"",
      endDate:""
  },
  tabShow(){
    this.setData({
      show:true
    })
  },
  tabClose(){
    this.setData({
      show:false
    })
  },
  getDate(){
    var date = new Date();
    var y = date.getFullYear();
    var m = date.getMonth()+1;
    var d = date.getDate();
    
    this.setData({
      date:y+"-"+m+"-"+d
    })
  },
  goToRecord(){
    wx.navigateTo({
      url: '/miniprogram/pages/record/record.wxml'
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    this.getDate();
    // this.getEndDate();
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {
    this.setData({
      show:true
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {
    this.getDate();
    // this.getEndDate();
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})